'''
Задача 2: 
Найдите сумму цифр трехзначного числа.
Пример:
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
'''

value = int(input("Введите трехзначное число: "))
summa = 0
while value > 0:
    n = value % 10
    summa += n
    value //= 10
print(summa)
